
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.baseRG: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest]
azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.Web/serverfarms/NiceGuiTest-ASP]
data.azurerm_client_config.current: Reading...
azurerm_linux_web_app.web_app: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.Web/sites/NiceGuiTest-APP]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03N2U1MTFmNi0wNjgyLTQxZDMtYTg0MC03NjU2NTY2YzBjY2E7b2JqZWN0SWQ9MjEwZTI0N2YtYjExNC00MGVkLWEzYjQtNTA0Yjc1NDI3MDg0O3N1YnNjcmlwdGlvbklkPTI2MDg2MjNlLTMyNmUtNDc2NS05NWZjLWI4ZjY1YTVjM2NiMTt0ZW5hbnRJZD1kMTk5MzkwMS1iYjUxLTQ5MmYtOGUwZC01NzJiMTM4NGYzYTY=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app_environment.nicegui will be created
  + resource "azurerm_container_app_environment" "nicegui" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "NiceGuiTest-ACE"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "NiceGuiTest"
      + static_ip_address                = (known after apply)
    }

  # azurerm_container_registry.nicegui will be created
  + resource "azurerm_container_registry" "nicegui" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "NiceGuiTestACR"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "NiceGuiTest"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.nicegui will be created
  + resource "azurerm_key_vault" "nicegui" {
      + access_policy                 = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = null
              + object_id               = "210e247f-b114-40ed-a3b4-504b75427084"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                ]
              + storage_permissions     = null
              + tenant_id               = "d1993901-bb51-492f-8e0d-572b1384f3a6"
            },
        ]
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "NiceGuiTest-KV"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "NiceGuiTest"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "d1993901-bb51-492f-8e0d-572b1384f3a6"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.ACR-PASS will be created
  + resource "azurerm_key_vault_secret" "ACR-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ACR-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ACR-URL will be created
  + resource "azurerm_key_vault_secret" "ACR-URL" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ACR-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ACR-USER will be created
  + resource "azurerm_key_vault_secret" "ACR-USER" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ACR-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.web_app will be destroyed
  # (because azurerm_linux_web_app.web_app is not in configuration)
  - resource "azurerm_linux_web_app" "web_app" {
      - app_settings                      = {
          - "SCM_DO_BUILD_DURING_DEPLOYMENT" = "true"
        } -> null
      - client_affinity_enabled           = false -> null
      - client_certificate_enabled        = false -> null
      - client_certificate_mode           = "Required" -> null
      - custom_domain_verification_id     = (sensitive value)
      - default_hostname                  = "niceguitest-app.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.Web/sites/NiceGuiTest-APP" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - kind                              = "app,linux" -> null
      - location                          = "eastus" -> null
      - name                              = "NiceGuiTest-APP" -> null
      - outbound_ip_address_list          = [
          - "52.151.220.65",
          - "52.151.220.76",
          - "52.151.220.92",
          - "52.151.220.113",
          - "52.151.220.203",
          - "52.151.220.211",
          - "20.119.16.24",
        ] -> null
      - outbound_ip_addresses             = "52.151.220.65,52.151.220.76,52.151.220.92,52.151.220.113,52.151.220.203,52.151.220.211,20.119.16.24" -> null
      - possible_outbound_ip_address_list = [
          - "52.151.220.65",
          - "52.151.220.76",
          - "52.151.220.92",
          - "52.151.220.113",
          - "52.151.220.203",
          - "52.151.220.211",
          - "52.151.221.61",
          - "52.151.221.107",
          - "52.151.221.137",
          - "52.151.221.182",
          - "52.151.221.201",
          - "52.151.221.227",
          - "52.151.221.228",
          - "52.151.221.247",
          - "52.151.222.80",
          - "52.151.222.84",
          - "52.151.222.148",
          - "52.151.222.203",
          - "52.151.222.214",
          - "52.151.222.216",
          - "52.151.223.28",
          - "52.151.223.64",
          - "52.151.223.71",
          - "52.151.223.138",
          - "20.119.16.24",
        ] -> null
      - possible_outbound_ip_addresses    = "52.151.220.65,52.151.220.76,52.151.220.92,52.151.220.113,52.151.220.203,52.151.220.211,52.151.221.61,52.151.221.107,52.151.221.137,52.151.221.182,52.151.221.201,52.151.221.227,52.151.221.228,52.151.221.247,52.151.222.80,52.151.222.84,52.151.222.148,52.151.222.203,52.151.222.214,52.151.222.216,52.151.223.28,52.151.223.64,52.151.223.71,52.151.223.138,20.119.16.24" -> null
      - resource_group_name               = "NiceGuiTest" -> null
      - service_plan_id                   = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.Web/serverfarms/NiceGuiTest-ASP" -> null
      - site_credential                   = [
          - {
              - name     = "$NiceGuiTest-APP"
              - password = "B3BSYqc9x0tkwpadHojgFpCh60KBGcRLWGvL5wD7u1DTokgTXl5wkPr7nLho"
            },
        ] -> null
      - tags                              = {} -> null

      - site_config {
          - always_on                               = true -> null
          - app_command_line                        = "python app.py" -> null
          - auto_heal_enabled                       = false -> null
          - container_registry_use_managed_identity = false -> null
          - default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> null
          - detailed_error_logging_enabled          = false -> null
          - ftps_state                              = "Disabled" -> null
          - health_check_eviction_time_in_min       = 0 -> null
          - http2_enabled                           = false -> null
          - linux_fx_version                        = "PYTHON|3.10" -> null
          - load_balancing_mode                     = "LeastRequests" -> null
          - local_mysql_enabled                     = false -> null
          - managed_pipeline_mode                   = "Integrated" -> null
          - minimum_tls_version                     = "1.2" -> null
          - remote_debugging_enabled                = false -> null
          - remote_debugging_version                = "VS2019" -> null
          - scm_minimum_tls_version                 = "1.2" -> null
          - scm_type                                = "None" -> null
          - scm_use_main_ip_restriction             = false -> null
          - use_32_bit_worker                       = true -> null
          - vnet_route_all_enabled                  = false -> null
          - websockets_enabled                      = false -> null
          - worker_count                            = 1 -> null

          - application_stack {
              - python_version = "3.10" -> null
            }
        }
    }

  # azurerm_log_analytics_workspace.nicegui will be created
  + resource "azurerm_log_analytics_workspace" "nicegui" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "eastus"
      + name                               = "NiceGuiTest-LAW"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "NiceGuiTest"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_service_plan.asp will be destroyed
  # (because azurerm_service_plan.asp is not in configuration)
  - resource "azurerm_service_plan" "asp" {
      - id                           = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/NiceGuiTest/providers/Microsoft.Web/serverfarms/NiceGuiTest-ASP" -> null
      - kind                         = "linux" -> null
      - location                     = "eastus" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "NiceGuiTest-ASP" -> null
      - os_type                      = "Linux" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "NiceGuiTest" -> null
      - sku_name                     = "B1" -> null
      - tags                         = {} -> null
      - worker_count                 = 1 -> null
      - zone_balancing_enabled       = false -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Joey40, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*